{
  "slug": "9c-modern-history-114-autumn",
  "hero_image": "1Z4ykTOJ40B704ZrL_hKCPCz2Nq6W_Pb-",
  "metadata": {
    "grade_level": "9",
    "domain_category": "main-lesson",
    "teacher_name": "林信宏/Lin Xin-Hong",
    "tags": [
      "現代史",
      "工業革命",
      "青年行動",
      "學習筆記"
    ]
  },
  "i18n": {
    "zh-TW": {
      "title": "現代史主課",
      "grade": "九年級 9C 心亮班",
      "semester": "114 學年度 秋季",
      "unit": "主課程",
      "domain": "歷史",
      "teacher": "林信宏",
      "overview": "這門現代史主課以十六堂課的節奏走過啟蒙、革命、工業到戰後世界，帶著九年級學生重新看見「歷史中的人」。課堂安排回顧、講述、辯論與筆記練習交織，學生每天閱讀史料並在工作本中建構自己的時間軸與概念圖。透過盧梭、拿破崙、羅伯·歐文到青年運動的案例，課程讓學生辨識自由與秩序、理想與代價的張力，也把自己視為正在形塑歷史的人。",
      "innovation_summary": "本課程突破了傳統歷史教學的線性敘事與背誦框架，將焦點從「事件的發生」轉移至「人性的抉擇」。透過將工業革命與當代 AI 議題連結，並運用原子彈投放的深層角色扮演，引導九年級學生置身於歷史現場的道德兩難中。這不只是一堂現代史，更是一場關於人類如何面對進步代價的哲學思辨，旨在喚醒學生意識到自己不僅是歷史的承受者，更是未來的創造者。",
      "innovation_question": "我們如何從歷史的旁觀者，轉身成為有意識的創造者？",      
      "learningObjectives": [
        "了解近代至現代歷史的主要脈絡，掌握思想與制度發展的連貫性。",
        "培養時間軸、人物關聯與概念分析能力，能以筆記與書寫統整歷史理解。",
        "培養對歷史的敬意與反思，理解自己身為「歷史的承繼者與創造者」。"
      ]
    },
    "en-US": {
      "title": "Modern History Main Lesson",
      "grade": "Grade 9, Class 9C Xinliang",
      "semester": "Academic Year 114, Autumn",
      "unit": "Main Lesson",
      "domain": "History",
      "teacher": "Lin Xin-Hong",
      "overview": "Across sixteen lessons this modern history block traces the path from the Enlightenment and revolutionary waves to the industrial age and postwar world, inviting students to keep asking who is acting inside history. Each morning we cycle through review, storytelling, debate, and deliberate note-making so learners read source material and build their own timelines and concept maps in the workbook. From Rousseau and Napoleon to Robert Owen and contemporary youth movements, students examine the tension between freedom and order, ideals and costs, and begin to see themselves as people actively shaping history.",
      "innovation_summary": "This course breaks through the linear narrative and memorization framework of traditional history teaching, shifting the focus from 'events' to 'human choices.' By connecting the Industrial Revolution with contemporary AI issues and utilizing deep role-playing regarding the atomic bomb decision, 9th-grade students are guided into the moral dilemmas of historical moments. This is not just a modern history class, but a philosophical speculation on how humanity faces the cost of progress, aiming to awaken students to the realization that they are not merely passive inheritors of history, but active creators of the future.",
      "innovation_question": "How do we turn from bystanders of history into conscious creators?",
      "learningObjectives": [
        "Understand the major throughlines from early modern to contemporary history and how ideas and institutions evolve together.",
        "Develop the ability to map timelines, relationships, and key concepts while using structured notes and writing to synthesize historical understanding.",
        "Cultivate respect and reflection toward history, recognizing themselves as inheritors and creators within the historical stream."
      ]
    }
  },
  "material": {
    "syllabus": [
      {
        "type": "pdf",
        "id": "1QEvQXOQiQGQOyxayr5-3AHi3XJCeeJDU",
        "title": "",
        "items": []
      }
    ],
    "workbook_photos": [
      {
        "type": "drive-folder",
        "id": "1f5__BLplGhnLEv6QdZNIAhxiwAsklpGw",
        "title": "",
        "items": []
      }
    ],
    "photos": [
      {
        "type": "drive-folder",
        "id": "17bt1nWggEAgKGLe9FBWvYs523hz05Z97",
        "title": "",
        "items": []
      }
    ],
    "blackboard": [
      {
        "type": "drive-folder",
        "id": "1gTA6mIvh4tfaF16m8dy1fOWF94a0oEZX",
        "title": "",
        "items": []
      }
    ],
    "worksheet": [
      {
        "type": "pdf",
        "id": "1Jv4ah9Ed6W8GHfroGV8PUMsW8HttI0QG",
        "title": "",
        "items": []
      }
    ],
    "videos": [
      {
        "type": "drive-folder",
        "id": "1J-hbJ9mZSGEVEXEnWRdFYGWL_9GvebOs",
        "title": "",
        "items": []
      }
    ]
  },
  "docs": {
    "course_description": {
      "type": "google-doc",
      "id": "1gcO5bBrNTfBxF5AY4J77A_V0UfhBeCoYy2ghYDbetlA",
      "title": "九年級現代史課程設計與教學實踐報告",
      "content": null,
      "lastSynced": null
    }
  }
}
